of1/averycavity/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

fields          ( U );

setFormat       raw;

sets
(
    middle_line
    {
        type    lineCell;
        axis    xyz;
        start   ( 0.048 -0.01 0.5e-2);
        end     ( 0.048 0.11 0.5e-2);
    }
);


// ************************************************************************* //
